Tekla Open API Reference for Tekla Structures 2025
HyperLink.Target Property
 Gets or sets the target.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Uri Target { get; set; }
Public Property Target As Uri
	Get
	Set
Property Value
Type: Uri
See Also
Reference
HyperLink Class
Tekla.Structures.Drawing Namespace